weight = [150, 150, 150, 100, 100, 100, 75, 75, 100, 100, 0, 0]
attr = ['小生命','小攻击','小防御','大生命','大攻击','大防御','暴击','爆伤','精通','充能','元素杯', '治疗']

posstr = ['生之花','死之羽','时之沙','空之杯','理之冠']
main_weight = [[1] + [0] * 11,
               [0, 1] + [0] * 10,
               [0] * 3 + [4/15] * 3 + [0, 0, .1, .1, 0, 0],
               [0] * 3 + [0.575/3] * 3 + [0, 0, 0.025, 0, 0.05, 0],
               [0] * 3 + [0.22] * 3 + [0.1, 0.1, 0.04, 0, 0, 0.05]]

score = [0, 0, 0, 0, 7, 0, 10, 10, 0, 3]
major = [6, 7]
minor = [4, 9]

base_score = [10000 * i for i in score]
for i in major:
    base_score[i] += 100
for i in minor:
    base_score[i] += 1

base_stat = [[0, 0, 0, 0, 3, 0, 3, 0, 0, 0],
             [0, 0, 0, 0, 2, 0, 5, 0, 0, 0],
             [0, 0, 0, 0, 0, 0, 4, 0, 0, 0],
             [0, 0, 0, 0, 0, 0, 3, 0, 0, 4],
             [0, 0, 0, 0, 2, 0, 3, 0, 0, 2]]

base_dict = [{(sum([base_score[j]*base_stat[i][j] for j in range(10)])):1} for i in range(5)]
main_list = [0, 1, 4, 10, 6]